of_test/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (solid liquid);

liquid
{
    type            pureMovingPhaseModel;
}

solid
{
    type            pureStaticSolidPhaseModel;
}

interfacePorous
(
    (solid and liquid)
    {
        type            VollerPrakash;
        solidPhase      alpha.solid;
        Cu              1e7;
    }
);

massTransferModel
(
    (solid to liquid)
    {
        type            Lee;
        C               1e6;
        Tactivate       1693.0;
    }
    /*(liquid to solid)
    {
        type            Lee;
        C               -1e6;
        Tactivate       600.0;
    }*/
);

/*massTransferModel
(
    (liquid to solid)
    {
        type            Lee;
        C               1e3;
        Tactivate       900.0;
    }
);*/

// ************************************************************************* //
