of_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       122000;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       123200;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2100;
        startFace       124400;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2100;
        startFace       126500;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1400;
        startFace       128600;
    }
)

// ************************************************************************* //
